# CreateReversed Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..CreateReversed Method
Curve Class See Also
---
Creates a new curve with the opposite orientation of the existing curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Curve CreateReversed()
```

Visual Basic
---
```text
Public Function CreateReversed As Curve
```

Visual C++
---
```text
public:
Curve^ CreateReversed()
```

# ### Return Value
The new curve.
# See Also
Curve Class
Autodesk.Revit.DB Namespace